In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"İsim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
           "Spor": ["koşu", "yüzme", "koşu", "basketbol"],
          "kalori": [100,200,300,400]}

In [3]:
df1 = pd.DataFrame(sozluk1, index = [0,1,2,3])
df1

     İsim       Spor  kalori
0   Ahmet       koşu     100
1  Mehmet      yüzme     200
2  Zeynep       koşu     300
3    Atıl  basketbol     400

In [4]:
sozluk2 = {"İsim": ["osman", "levent", "atlas", "fatma"],
           "Spor": ["koşu", "yüzme", "koşu", "basketbol"],
          "kalori": [200,500,100,50]}

In [5]:
df2 = pd.DataFrame(sozluk2, index = [0,1,2,3])
df2

     İsim       Spor  kalori
0   osman       koşu     200
1  levent      yüzme     500
2   atlas       koşu     100
3   fazma  basketbol      50

In [12]:
sozluk3 = {"İsim": ["ayse", "mahmud", "duygu", "nur"],
           "Spor": ["koşu", "yüzme", "badminton", "tenis"],
          "kalori": [250,450,10,500]}

In [13]:
df3 = pd.DataFrame(sozluk3, index = [0,1,2,3])
df3

     İsim       Spor  kalori
0    ayse       koşu     250
1  mahmud      yüzme     450
2   duygu  badminton      10
3     nur      tenis     500

In [14]:
#concatenation # üç df i alt alta koyma

In [15]:
pd.concat([df1,df2,df3])

     İsim       Spor  kalori
0   Ahmet       koşu     100
1  Mehmet      yüzme     200
2  Zeynep       koşu     300
3    Atıl  basketbol     400
0   osman       koşu     200
1  levent      yüzme     500
2   atlas       koşu     100
3   fazma  basketbol      50
0    ayse       koşu     250
1  mahmud      yüzme     450
2   duygu  badminton      10
3     nur      tenis     500

In [16]:
#Merge(birleştirme buda ama kaynaştırmak gibi bi manaya geliyor)

In [17]:
sozluk1 = {"İsim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
           "Spor": ["koşu", "yüzme", "koşu", "basketbol"]}

In [18]:
df1 = pd.DataFrame(sozluk1, index = [0,1,2,3])
df1

     İsim       Spor
0   Ahmet       koşu
1  Mehmet      yüzme
2  Zeynep       koşu
3    Atıl  basketbol

In [19]:
sozluk2 = {"İsim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
          "kalori": [200,500,100,50]}

In [20]:
df2 = pd.DataFrame(sozluk2, index = [0,1,2,3])
df2

     İsim  kalori
0   Ahmet     200
1  Mehmet     500
2  Zeynep     100
3    Atıl      50

In [25]:
pd.merge(df1,df2, on = "İsim") #burada birleştiriyor belirli ortak kolon üzerinden işlem gerçekleştirdik

     İsim       Spor  kalori
0   Ahmet       koşu     200
1  Mehmet      yüzme     500
2  Zeynep       koşu     100
3    Atıl  basketbol      50

In [ ]:
#Pandas ile ileri Operasyonlar

In [26]:
maasSozluk = {"isim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
             "departman": ["yazılım","satıs","pazarlama","yazılım"],
             "maas": [200,300,400,500]}

In [27]:
maasdf = pd.DataFrame(maasSozluk)

In [28]:
maasdf

     isim  departman  maas
0   Ahmet    yazılım   200
1  Mehmet      satıs   300
2  Zeynep  pazarlama   400
3    Atıl    yazılım   500

In [29]:
maasdf["departman"]

0      yazılım
1        satıs
2    pazarlama
3      yazılım
Name: departman, dtype: object

In [30]:
maasdf["departman"].unique() #kendine has tekilleri getirecek

array(['yazılım', 'satıs', 'pazarlama'], dtype=object)

In [32]:
maasdf["departman"].nunique() #number of unique

3

In [33]:
maasdf["departman"].value_counts()

yazılım      2
satıs        1
pazarlama    1
Name: departman, dtype: int64

In [41]:
def buruttenNete(maas):
    return maas * 0.66

In [42]:
maasdf["maas"].apply(buruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: maas, dtype: float64

In [43]:
maasdf.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [52]:
yeniveri = {"karakter": ["south park","south park", "simpson","simpson","simpson"],
           "karakter ismi": ["cartman", "kenny", "homer", "bart","bart"],
           "karakter yas": [9,10,50,20,10]}

In [53]:
karakterdf = pd.DataFrame(yeniveri)

In [54]:
karakterdf

     karakter karakter ismi  karakter yas
0  south park       cartman             9
1  south park         kenny            10
2     simpson         homer            50
3     simpson          bart            20
4     simpson          bart            10

In [56]:
karakterdf.pivot_table(values = "karakter yas", index = ["karakter", "karakter ismi"], aggfunc = np.sum)

                          karakter yas
karakter   karakter ismi
simpson    bart                     30
           homer                    50
south park cartman                   9
           kenny                    10